const allData = {
    "2026-07-21-08-00": [
        { 
            rashi: "लग्न भाव", 
            icon: "✨", 
            msg: "कन्या राशि में शुक्र आपके लग्न (प्रथम) भाव में नीच के स्थित हैं। आपके व्यक्तित्व और आकर्षण में कुछ सुस्ती आ सकती है; इस दौरान स्वास्थ्य, वैवाहिक जीवन और निर्णय लेते समय विशेष सावधानी बरतें।" 
        },

        { 
            rashi: "षष्ठ भाव", 
            icon: "🌀", 
            msg: "कुंभ राशि में राहु आपके षष्ठ (रोग/शत्रु) भाव में स्थित हैं। शत्रुओं पर विजय प्राप्त होगी, लेकिन स्वास्थ्य, खान-पान और गुप्त शत्रुओं को लेकर विशेष सावधानी बरतें।" 
        },
        { 
            rashi: "सप्तम भाव", 
            icon: "🪐", 
            msg: "मीन राशि में शनि (वक्रि) और नेप्च्यून आपके सप्तम (दांपत्य/साझेदारी) भाव में स्थित हैं। जीवनसाथी या व्यावसायिक पार्टनरशिप में धैर्य रखें और गलतफहमियों से बचें।" 
        },
        { 
            rashi: "दशम भाव", 
            icon: "🔴", 
            msg: "कन्या राशि के जातकों के लिए मंगल ग्रह दसवें (कर्म) भाव में गोचर कर रहे हैं। यह समय आपके करियर और व्यवसाय के लिए बहुत महत्वपूर्ण है। नौकरीपेशा लोगों को कार्यस्थल पर नई जिम्मेदारियां मिल सकती हैं और बॉस का साथ मिलेगा। विरोधियों और शत्रुओं पर आप पूरी तरह विजय प्राप्त करेंगे। हालांकि, काम का दबाव अधिक रहने के कारण मानसिक थकान महसूस हो सकती है। " },
        
        { 
            rashi: "एकादश भाव", 
            icon: "☀️", 
            msg: "कर्क राशि में सूर्य, बुध और देवगुरु बृहस्पति (अस्त) आपके एकादश (लाभ) भाव में स्थित हैं। वरिष्ठ जनों और मित्रों का सहयोग मिलेगा, आय के नए स्रोत बन सकते हैं।" 
        },
        { 
            rashi: "द्वादश भाव", 
            icon: "🪞", 
            msg: "सिंह राशि में केतु आपके द्वादश (व्यय/मोक्ष) भाव में स्थित हैं। आध्यात्मिक उन्नति के अवसर मिलेंगे, परंतु अनिद्रा, अनावश्यक खर्चों और विदेश से जुड़े मामलों में कुछ बाधाओं का सामना करना पड़ सकता है।" 
        },
 
    ]
};
