const allData = {
    "2026-07-21-08-00": [
        { 
            rashi: "प्रथम भाव (लग्न)", 
            icon: "☀️", 
            msg: "कर्क राशि में लग्न (प्रथम भाव) में सूर्य, बुध और देवगुरु बृहस्पति (अस्त) गोचर में स्थित हैं। आपके व्यक्तित्व में तेज, ज्ञान और आत्मविश्वास की वृद्धि होगी, साथ ही मान-सम्मान बढ़ेगा।" 
        },
        { 
            rashi: "द्वितीय भाव", 
            icon: "🪞", 
            msg: "सिंह राशि में केतु आपके द्वितीय (धन/वाणी) भाव में स्थित हैं। इस दौरान अपनी वाणी में कठोरता आने से बचें और आर्थिक लेन-देन या परिवार से जुड़े मामलों में विशेष सावधानी बरतें।" 
        },
        { 
            rashi: "तृतीय भाव", 
            icon: "✨", 
            msg: "कन्या राशि में शुक्र आपके तृतीय (पराक्रम/भाई-बहन) भाव में स्थित हैं। आपके साहस और पराक्रम में वृद्धि होगी, कलात्मक और संवाद से जुड़े कार्यों में आपको अनुकूल परिणाम मिल सकते हैं।" 
        },
        
        { 
            rashi: "अष्टम भाव", 
            icon: "🌀", 
            msg: "कुंभ राशि में राहु आपके अष्टम भाव में गोचर में स्थित हैं। इस दौरान अचानक आने वाली परिस्थितियों या स्वास्थ्य को लेकर विशेष सतर्कता बरतने की आवश्यकता है।" 
        },
        { 
            rashi: "नवम भाव", 
            icon: "🪐", 
            msg: "मीन राशि में शनि आपके नवम (भाग्य) भाव में गोचर में स्थित हैं। भाग्य का साथ पाने के लिए आपको निरंतर और कड़ी मेहनत करनी होगी, धार्मिक कार्यों में रुचि बढ़ेगी।" 
        },
        
        { 
            rashi: "द्वादश भाव", 
            icon: "🔴", 
            msg: "कर्क राशि वालों के लिए मंगल ग्रह बारहवें भाव में गोचर कर रहे हैं। यह स्थिति खर्चों में अचानक बढ़ोतरी और यात्राओं की अधिकता का संकेत देती है। स्वास्थ्य को लेकर विशेष सतर्कता बरतनी होगी, विशेषकर रक्तचाप या चोट-चपेट से जुड़ी समस्याओं को नजरअंदाज न करें। विदेश से जुड़े कार्यों या विदेशी स्रोतों से लाभ मिलने की संभावना बन सकती है।"
        },
    ]
};
