const allData = {
    "2026-07-21-08-00": [
        { 
            rashi: "प्रथम भाव (लग्न)", 
            icon: "🟡🔴", 
            msg: "कर्क राशि में लग्न (प्रथम भाव) में देवगुरु बृहस्पति और मंगल गोचर में स्थित हैं। आपके व्यक्तित्व में तेज, ज्ञान और आत्मविश्वास की वृद्धि होगी, साथ ही मान-सम्मान बढ़ेगा।" 
        },
        { 
            rashi: "द्वितीय भाव", 
            icon: "🟣", 
            msg: "सिंह राशि में केतु आपके द्वितीय (धन/वाणी) भाव में स्थित हैं। इस दौरान अपनी वाणी में कठोरता आने से बचें और आर्थिक लेन-देन या परिवार से जुड़े मामलों में विशेष सावधानी बरतें।" 
        },
        { 
            rashi: "तृतीय भाव", 
            icon: "🌞🟢", 
            msg: "कर्क राशि वालों के लिए सूर्य व बुध का गोचर आपका तीसरे घर में है। पराक्रम और आत्मविश्वास में वृद्धि होगी।. छोटे भाई-बहनों और मित्रों का भरपूर सहयोग मिलेगा।. यात्राएं लाभदायक और आनंददायक साबित होंगी, वाणी पर नियंत्रण रखें।" 
        },

        { 
            rashi: "चतुर्थ भाव", 
            icon: "✨", 
            msg: "तुला राशि में शुक्र आपके चतुर्थ भाव (सुख भाव) में है। भौतिक सुख-सुविधाओं में वृद्धि होगी, घर-परिवार में आनंद का वातावरण रहेगा। माता का सानिध्य और स्वास्थ्य उत्तम रहेगा। भूमि, भवन या वाहन खरीदने के प्रबल योग बन रहे हैं।" 
        },

        
        { 
            rashi: "अष्टम भाव", 
            icon: "🟤", 
            msg: "कुंभ राशि में राहु आपके अष्टम भाव में गोचर में स्थित हैं। इस दौरान अचानक आने वाली परिस्थितियों या स्वास्थ्य को लेकर विशेष सतर्कता बरतने की आवश्यकता है।" 
        },
        { 
            rashi: "नवम भाव", 
            icon: "⚫", 
            msg: "मीन राशि में शनि आपके नवम (भाग्य) भाव में गोचर में स्थित हैं। भाग्य का साथ पाने के लिए आपको निरंतर और कड़ी मेहनत करनी होगी, धार्मिक कार्यों में रुचि बढ़ेगी।" 
        },
    ]
};
