const allData = {
    "2026-07-21-08-00": [
        { 
            rashi: "प्रथम भाव (लग्न भाव)", 
            icon: "🌀", 
            msg: "कुंभ लग्न में राहु आपके प्रथम भाव में स्थित हैं। व्यक्तित्व में उग्रता, स्वतंत्रता की भावना और कुछ अप्रत्याशित बदलाव देखने को मिल सकते हैं, सोच-समझकर निर्णय लें।" 
        },
        { 
            rashi: "द्वितीय भाव", 
            icon: "🪐", 
            msg: "मीन राशि में शनि (वक्रि) और नेप्च्यून आपके द्वितीय (धन/वाणी) भाव में स्थित हैं। आर्थिक मामलों में कड़ा अनुशासन और धैर्य रखना होगा, तथा वाणी में संयम बरतें।" 
        },
        
        { 
            rashi: "पंचम भाव", 
            icon: "🔴", 
            msg: "कुंभ राशि के जातकों के लिए मंगल ग्रह पांचवें (बुद्धि, संतान और प्रेम) भाव में गोचर कर रहे हैं। विद्यार्थियों की एकाग्रता में वृद्धि होगी और पठन-पाठन में अच्छा प्रदर्शन करेंगे। संतान पक्ष से कोई सुखद समाचार मिल सकता है। शेयर बाजार या सट्टा जैसे क्षेत्रों में अचानक धन लाभ की स्थिति बन सकती है, परंतु जोखिम भरे निवेश से बचना ही बुद्धिमानी होगी। प्रेम संबंधों में उग्रता या जिद दिखाने से बचें। " 
        },
        { 
            rashi: "षष्ठ भाव", 
            icon: "🟢🟡", 
            msg: "कर्क राशि में बुध और देवगुरु बृहस्पति (अस्त) आपके षष्ठ (रोग/शत्रु) भाव में स्थित हैं। गुप्त शत्रुओं पर विजय प्राप्त होगी, लेकिन खान-पान और स्वास्थ्य संबंधी छोटी-मोटी परेशानियों को नजरअंदाज न करें।" 
        },
         { 
            rashi: "सप्तम भाव", 
            icon: "🌞🟣", 
            msg: "सिंह राशि में सूर्य और केतु आपके सप्तम (जीवनसाथी/साझेदारी) भाव में स्थित हैं। वैवाहिक जीवन और व्यापारिक साझेदारियों में गलतफहमियों से बचने के लिए संवाद को स्पष्ट रखें तथा पार्टनर की भावनाओं का सम्मान करें।" 
        },
        { 
            rashi: "अष्टम भाव", 
            icon: "✨", 
            msg: "कन्या राशि में शुक्र आपके अष्टम (आयु/आकस्मिक लाभ) भाव में स्थित हैं। स्वास्थ्य के प्रति विशेष सचेत रहें, तथा गुप्त धन या अचानक होने वाले खर्चों और निवेश के मामलों में सावधानी बरतें।" 
        }
        
    ]
};
