const allData = {
    "2026-07-21-08-00": [
        { 
            rashi: "प्रथम भाव (लग्न भाव)", 
            icon: "🌀", 
            msg: "कुंभ लग्न में राहु आपके प्रथम भाव में स्थित हैं। व्यक्तित्व में उग्रता, स्वतंत्रता की भावना और कुछ अप्रत्याशित बदलाव देखने को मिल सकते हैं, सोच-समझकर निर्णय लें।" 
        },
        { 
            rashi: "द्वितीय भाव", 
            icon: "🪐", 
            msg: "मीन राशि में शनि (वक्रि) और नेप्च्यून आपके द्वितीय (धन/वाणी) भाव में स्थित हैं। आर्थिक मामलों में कड़ा अनुशासन और धैर्य रखना होगा, तथा वाणी में संयम बरतें।" 
        },
        { 
            rashi: "षष्ठ भाव", 
            icon: "🟡🔴", 
            msg: "कर्क राशि में देवगुरु बृहस्पति और मंगल आपके षष्ठ (रोग/शत्रु) भाव में स्थित हैं। गुप्त शत्रुओं पर विजय प्राप्त होगी, लेकिन खान-पान और स्वास्थ्य संबंधी छोटी-मोटी परेशानियों को नजरअंदाज न करें।" 
        },
         { 
            rashi: "सप्तम भाव", 
            icon: "🟣", 
            msg: "सिंह राशि में केतु आपके सप्तम (जीवनसाथी/साझेदारी) भाव में स्थित हैं। वैवाहिक जीवन और व्यापारिक साझेदारियों में गलतफहमियों से बचने के लिए संवाद को स्पष्ट रखें तथा पार्टनर की भावनाओं का सम्मान करें।" 
        },
        { 
            rashi: "अष्टम भाव", 
            icon: "🌞🟢", 
            msg: "कुंभ राशि वालों के लिए सूर्य व बुध का गोचर आपका आठवें घर में है। अचानक धन लाभ के योग बन सकते हैं, जैसे पैतृक संपत्ति से लाभ।. गुप्त विद्याओं या ज्योतिष के प्रति झुकाव बढ़ सकता है।. स्वास्थ्य के प्रति अत्यधिक सतर्क रहें और वाहन सावधानी से चलाएं।" 
        },

        { 
            rashi: "नवम भाव", 
            icon: "✨", 
            msg: "तुला राशि में शुक्र आपके नौवें भाव (भाग्य भाव) में है। भाग्य का पूरा साथ मिलेगा, रुके हुए कार्य गति पकड़ेंगे। धार्मिक और मांगलिक कार्यों में रुचि बढ़ेगी। लंबी दूरी की यात्रा सुखद और लाभदायक रहेगी।" 
        },
    ]
};
