const allData = {
    "2026-07-21-08-00": [
        { 
            rashi: "द्वितीय भाव", 
            icon: "🌀", 
            msg: "कुंभ राशि में राहु आपके द्वितीय (धन/वाणी) भाव में स्थित हैं। वाणी में तीखापन आ सकता है, इसलिए बातचीत में सावधानी रखें। आर्थिक मामलों में अचानक उतार-चढ़ाव या बड़े फैसले लेने पड़ सकते हैं।" 
        },
        { 
            rashi: "तृतीय भाव", 
            icon: "🪐", 
            msg: "मीन राशि में शनि (वक्रि) और नेप्च्यून आपके तृतीय (पराक्रम/साहस) भाव में स्थित हैं। आपके पराक्रम और प्रयासों में धैर्य की आवश्यकता होगी, तथा भाई-बहनों के साथ संबंधों में नरमी बरतें।" 
        },
        
        { 
            rashi: "षष्ठ भाव", 
             icon: "🔴", 
             msg: "मकर राशि वालों के लिए छठे (रोग, ऋण और शत्रु) भाव में मंगल और बुध ग्रहों का गोचर शत्रुओं पर विजय दिलाने वाला साबित होगा। कोर्ट-कचहरी या पुराने कानूनी मामलों में फैसला आपके पक्ष में आ सकता है। प्रतियोगिता परीक्षा की तैयारी कर रहे जातकों को शानदार सफलता मिलने के योग हैं। हालांकि, गुप्त शत्रु आपको परेशान करने की कोशिश करेंगे, लेकिन वे असफल रहेंगे। "
        },
        { 
            rashi: "सप्तम भाव", 
            icon: "☀️", 
            msg: "कर्क राशि में सूर्य और देवगुरु बृहस्पति (अस्त) आपके सप्तम (जीवनसाथी/साझेदारी) भाव में स्थित हैं। वैवाहिक जीवन और व्यापारिक साझेदारियों में मान-सम्मान बढ़ेगा, लेकिन अहम् के टकराव से बचें।" 
        },
        { 
            rashi: "अष्टम भाव", 
            icon: "🪞", 
            msg: "सिंह राशि में केतु आपके अष्टम (आयु/आकस्मिक घटनाएं) भाव में स्थित हैं। स्वास्थ्य को लेकर विशेष सतर्कता बरतें, और अचानक आने वाली बाधाओं या गुप्त मामलों में जल्दबाजी से बचें।" 
        },
        { 
            rashi: "नवम भाव", 
            icon: "✨", 
            msg: "कन्या राशि में शुक्र आपके नवम (भाग्य) भाव में स्थित हैं। धार्मिक और आध्यात्मिक विषयों में रुचि बढ़ेगी, हालांकि भाग्य का पूरा साथ पाने के लिए आपको सामान्य से अधिक प्रयास करने पड़ सकते हैं।" 
        }
        
    ]
};
