const allData = {
    "2026-08-23-08-00": [
        { 
            rashi: " मंगल गोचर (तीसरे भाव में)", 
            icon: "🔴", 
            msg: "मंगल का गोचर आपकी राशि से तीसरे भाव (पराक्रम, साहस, भाई-बहन और छोटे सफर) में हुआ है। ज्योतिष में तीसरे भाव का मंगल बहुत ही पराक्रमी और शुभ फलदायी माना जाता है। इस अवधि में आपके साहस और आत्मविश्वास में अभूतपूर्व वृद्धि होगी। आप हर चुनौती का डटकर सामना करेंगे। छोटे भाइयों-बहनों और मित्रों का पूरा सहयोग प्राप्त होगा। कार्यक्षेत्र में आपकी मेहनत रंग लाएगी और आपकी नेतृत्व क्षमता की सराहना होगी। इस दौरान की गई छोटी यात्राएं आपके लिए अत्यंत लाभदायक सिद्ध होंगी।" 
             
         },
        
        { 
            rashi: "बृहस्पति (चौथे भाव में)", 
            icon: "🟡", 
            msg: "देवगुरु बृहस्पति चौथे भाव में गोचर कर रहे हैं, जो आपको घरेलू सुख-सुविधाओं और मानसिक शांति का लाभ देंगे। ज्ञान और समझदारी से घर के बड़े फैसले पक्ष में रहेंगे।" 
        },
         
        { 
            rashi: "पंचम भाव", 
            icon: "🌞🟢🟣", 
            msg: "सिंह राशि में सूर्य, बुध और केतु आपके पंचम (बुद्धि/संतान/शिक्षा) भाव में स्थित हैं। विद्यार्थियों की एकाग्रता में उतार-चढ़ाव आ सकता है, तथा संतान पक्ष या शेयर बाजार जैसे जोखिम भरे निवेश के मामलों में सावधानी बरतने की आवश्यकता है।" 
        },
        { 
            rashi: "सप्तम भाव", 
            icon: "✨", 
            msg: "तुला राशि में शुक्र आपके सातवें भाव में है। वैवाहिक जीवन में मधुरता बढ़ेगी और जीवनसाथी के साथ समय बिताने के बेहतरीन अवसर मिलेंगे। व्यापारिक साझेदारी में लाभ होगा और नए अनुबंध (Contracts) मिल सकते हैं। जनसंपर्क और सामाजिक दायरा मजबूत होगा।" 
        },

        { 
            rashi: "शनि व राहु गोचर (द्वादश व एकादश भाव)", 
            icon: "🪐", 
            msg: "मीन राशि में शनि (बारहवें भाव) और कुंभ राशि में राहु (ग्यारहवें भाव) गोचर कर रहे हैं। आय के नए स्रोत बनेंगे, परंतु अनावश्यक खर्चों और लंबी यात्राओं में सतर्कता बरतें।" 
        },
    ]
};
