const allData = [
        { 
            rashi: " मंगल गोचर (तीसरे भाव में)", 
            icon: "🔴", 
            msg: "मंगल का गोचर आपकी राशि से तीसरे भाव (पराक्रम, साहस, भाई-बहन और छोटे सफर) में हुआ है। ज्योतिष में तीसरे भाव का मंगल बहुत ही पराक्रमी और शुभ फलदायी माना जाता है। इस अवधि में आपके साहस और आत्मविश्वास में अभूतपूर्व वृद्धि होगी। आप हर चुनौती का डटकर सामना करेंगे। छोटे भाइयों-बहनों और मित्रों का पूरा सहयोग प्राप्त होगा। कार्यक्षेत्र में आपकी मेहनत रंग लाएगी और आपकी नेतृत्व क्षमता की सराहना होगी। इस दौरान की गई छोटी यात्राएं आपके लिए अत्यंत लाभदायक सिद्ध होंगी।" 
             
         },
        
        { 
            rashi: "बृहस्पति और बुध गोचर (चौथे भाव में)", 
            icon: "🟡", 
            msg: "देवगुरु बृहस्पति चौथे भाव में गोचर कर रहे हैं, जो आपको घरेलू सुख-सुविधाओं और मानसिक शांति का लाभ देंगे। ज्ञान और समझदारी से घर के बड़े फैसले पक्ष में रहेंगे।" 
        },
         
        { 
            rashi: "पंचम भाव", 
            icon: "🌞🟢🟣", 
            msg: "सिंह राशि में सूर्य, बुध और केतु आपके पंचम (बुद्धि/संतान/शिक्षा) भाव में स्थित हैं। विद्यार्थियों की एकाग्रता में उतार-चढ़ाव आ सकता है, तथा संतान पक्ष या शेयर बाजार जैसे जोखिम भरे निवेश के मामलों में सावधानी बरतने की आवश्यकता है।" 
        },
        { 
            rashi: "षष्ठ भाव", 
            icon: "✨", 
            msg: "कन्या राशि में शुक्र आपके षष्ठ (रोग/शत्रु) भाव में नीच के स्थित हैं। गुप्त शत्रुओं और स्वास्थ्य को लेकर विशेष सतर्कता रखें, तथा अनावश्यक खर्चों और कर्ज की स्थिति से बचने का प्रयास करें।" 
        },
        { 
            rashi: "शनि व राहु गोचर (द्वादश व एकादश भाव)", 
            icon: "🪐", 
            msg: "मीन राशि में शनि (बारहवें भाव) और कुंभ राशि में राहु (ग्यारहवें भाव) गोचर कर रहे हैं। आय के नए स्रोत बनेंगे, परंतु अनावश्यक खर्चों और लंबी यात्राओं में सतर्कता बरतें।" 
        }
    ];
