const allData = {
    "2026-08-23-08-00": [
        { 
            rashi: "बृहस्पति (चौथे भाव में)", 
            icon: "🟡🔴", 
            msg: "देवगुरु बृहस्पति और मंगल चौथे भाव में गोचर कर रहे हैं, जो आपको घरेलू सुख-सुविधाओं और मानसिक शांति का लाभ देंगे। ज्ञान और समझदारी से घर के बड़े फैसले पक्ष में रहेंगे।" 
        },
         
        { 
            rashi: "पंचम भाव", 
            icon: "🟣", 
            msg: "सिंह राशि में केतु आपके पंचम (बुद्धि/संतान/शिक्षा) भाव में स्थित हैं। विद्यार्थियों की एकाग्रता में उतार-चढ़ाव आ सकता है, तथा संतान पक्ष या शेयर बाजार जैसे जोखिम भरे निवेश के मामलों में सावधानी बरतने की आवश्यकता है।" 
        },
        { 
            rashi: "षष्ठम भाव", 
            icon: "🌞🟢", 
            msg: "मेष राशि वालों के लिए सूर्य व बुध का गोचर आपके छठे घर में है। शत्रुओं और विरोधियों पर विजय प्राप्त होगी।. कोर्ट-कचहरी या कानूनी मामलों में सफलता मिल सकती है।. स्वास्थ्य का विशेष ध्यान रखें और कर्ज लेने या देने से बचें।" 
        },

        { 
            rashi: "सप्तम भाव", 
            icon: "✨", 
            msg: "तुला राशि में शुक्र आपके सातवें भाव में है। वैवाहिक जीवन में मधुरता बढ़ेगी और जीवनसाथी के साथ समय बिताने के बेहतरीन अवसर मिलेंगे। व्यापारिक साझेदारी में लाभ होगा और नए अनुबंध (Contracts) मिल सकते हैं। जनसंपर्क और सामाजिक दायरा मजबूत होगा।" 
        },

        { 
            rashi: "शनि व राहु गोचर (द्वादश व एकादश भाव)", 
            icon: "🪐", 
            msg: "मीन राशि में शनि (बारहवें भाव) और कुंभ राशि में राहु (ग्यारहवें भाव) गोचर कर रहे हैं। आय के नए स्रोत बनेंगे, परंतु अनावश्यक खर्चों और लंबी यात्राओं में सतर्कता बरतें।" 
        },
    ]
};
