const allData = {
    "2026-07-21-08-00": [
        { 
            rashi: "प्रथम भाव (लग्न)", 
            icon: "🔴", 
            msg: "मंगल ग्रह का गोचर आपकी ही राशि यानी प्रथम भाव में हुआ है। इसके प्रभाव से आपके भीतर गजब का आत्मविश्वास और ऊर्जा देखने को मिलेगी। रुके हुए कार्य गति पकड़ेंगे और आप नेतृत्व क्षमता से हर क्षेत्र में आगे रहेंगे। हालांकि, स्वभाव में आक्रामकता और जल्दबाजी बढ़ सकती है। वैवाहिक जीवन या साझेदारी के कामों में अहं के टकराव से बचें और गुस्से पर नियंत्रण रखें।"
        },
        { 
            rashi: "द्वितीय भाव (धन भाव)", 
            icon: "🟡", 
            msg: "कर्क राशि में देवगुरु बृहस्पति दूसरे (धन भाव) में गोचर में स्थित हैं। आर्थिक मामलों में सुधार होगा, वाणी में मधुरता आएगी और परिवार का पूरा सहयोग मिलेगा।" 
        },
        { 
            rashi: "तृतीय भाव", 
            icon: "🌞🟢🟣",
            msg: "सिंह राशि में सूर्य, बुध और केतु आपके तृतीय (पराक्रम/साहस) भाव में स्थित हैं। आपके साहस और आत्मविश्वास में कुछ अप्रत्याशित बदलाव आ सकता है, तथा छोटे भाई-बहनों या यात्राओं से जुड़े मामलों में सावधानी बरतें।" 
        },
        { 
            rashi: "पंचम भाव", 
            icon: "✨", 
            msg: "तुला राशि में शुक्र आपके पंचम भाव (विद्या व संतान भाव) में है। विद्यार्थियों और कलाकारों के लिए यह समय अत्यंत अनुकूल रहेगा, पढ़ाई और कला में मन लगेगा। संतान पक्ष से कोई सुखद समाचार मिल सकता है। प्रेम संबंधों में प्रगाढ़ता आएगी और शेयर बाजार से लाभ के योग हैं।" 
        },

    
        { 
            rashi: "नवम भाव", 
            icon: "🌀", 
            msg: "कुंभ राशि में राहु आपके नवम (भाग्य) भाव में गोचर में स्थित हैं। भाग्य के मामलों में कुछ अप्रत्याशित उतार-चढ़ाव या नई चीज़ें देखने को मिल सकती हैं, सोच-समझकर निर्णय लें।" 
        },
        { 
            rashi: "दशम भाव", 
            icon: "🪐", 
            msg: "मीन राशि में शनि आपके दशम (कर्म भाव) में गोचर में स्थित हैं। कार्यक्षेत्र में सफलता पाने के लिए आपको कड़ी मेहनत और निरंतर प्रयास करने होंगे।" 
        },
        
    ]
};
