const panchangData = {
  "2026-08-06": {
        day: "गुरुवार",
        date: "06 अगस्त 2026",
        vikramSambat: "विक्रम संवत 2083 सिद्धार्थ्व",
        shakSambat: "शक सम्वत 1948 पराभव",
        ayan: "दक्षिणायन",
        ritu: "वर्षा ऋतु",
        amasMonth: "आषाढ़",
        purnimantMonth: "श्रावण",
        tithi: "कृष्ण पक्ष अष्टमी - 06:52 पी एम तक, उपरांत नवमी",
        nakshatra: "भरणी - 08:13 पी एम तक, उपरांत कृत्तिका",
        yog: "गण्ड - 03:01 पी एम तक, उपरांत वृद्धि",
        karan: "बालव - 07:50 ए एम तक, कौलव - 06:52 पी एम तक",
        
        sunMoonTransit: "सूर्य: कर्क राशि | चन्द्रमा: मेष राशि",
        sunSign: "कर्क राशि",
        moonSign: "मेष राशि",
        
        sunriseSunset: "सूर्योदय: 05:44 AM | सूर्यास्त: 07:09 PM",
        sunrise: "05:44 AM",
        sunset: "07:09 PM",
        abhijitMuhurat: "दोपहर 12:00 से 12:53 तक",
        rahukaal: "दोपहर 02:07 से 03:48 तक",
        dishaShool: "दक्षिण दिशा",
        remedy: "विष्णु सहस्रनाम का पाठ करें.",
        nakshatraphal: "भरणी नक्षत्र उग्र कार्यों के लिए जाना जाता है.",
        special: "दैनिक सामान्य व्रत."
      },
    "2026-08-07": {
        day: "शुक्रवार",
        date: "07 अगस्त 2026",
        vikramSambat: "विक्रम संवत 2083",
        ayan: "दक्षिणायन",
        ritu: "वर्षा ऋतु",
        tithi: "श्रावण कृष्ण पक्ष नवमी - 04:36 पी एम तक, उपरांत दशमी",
        nakshatra: "कृत्तिका - 06:42 पी एम तक, उपरांत रोहिणी",
        yog: "वृद्धि - 12:09 पी एम तक, उपरांत ध्रुव",
        karan: "तैतिल - 05:47 ए एम तक, गरज - 04:36 पी एम तक, वणिज - 03:19 ए एम (अगले दिन) तक",
        
        sunMoonTransit: "सूर्य: कर्क राशि | चन्द्रमा: वृषभ राशि",
        sunSign: "कर्क राशि",
        moonSign: "वृषभ राशि",
        
        sunriseSunset: "सूर्योदय: 05:45 AM | सूर्यास्त: 07:07 PM",
        sunrise: "05:45:24 AM",
        sunset: "07:07:18 PM",

        abhijitMuhurat: "दोपहर 12:00 से 12:54 तक",
        rahukaal: "सुबह 10:44 से दोपहर 12:26 तक",
        dishaShool: "पश्चिम दिशा",
        remedy: "माता लक्ष्मी को खीर का भोग लगाएं.",
        nakshatraphal: "कृत्तिका नक्षत्र तेज और अग्नि से संबंधित कार्यों के लिए उत्तम है.",
        special: "दैनिक पंचांग।"
    },
  "2026-08-08": {
    day: "शनिवार",
    date: "08 अगस्त 2026",
    vikramSambat: "विक्रम संवत 2083",
    ayan: "दक्षिणायन",
    ritu: "वर्षा ऋतु",
    tithi: "श्रावण कृष्ण पक्ष दशमी - 01:58 पी एम तक, उपरांत एकादशी",
    nakshatra: "रोहिणी - 04:50 पी एम तक, उपरांत मृगशिरा",
    yog: "ध्रुव - 09:00 ए एम तक, उपरांत व्याघात",
    karan: "विष्टि भद्र - 01:58 पी एम तक, बव - 02:33 ए एम (अगले दिन) तक",
    
    sunMoonTransit: "सूर्य: कर्क राशि | चन्द्रमा: वृषभ राशि (27:47:57* तक, उपरांत मिथुन राशि)",
    sunSign: "कर्क राशि",
    moonSign: "वृषभ राशि",
    
    sunriseSunset: "सूर्योदय: 05:45 AM | सूर्यास्त: 07:06 PM",
    sunrise: "05:45:58 AM",
    sunset: "07:06:28 PM",

    abhijitMuhurat: "दोपहर 12:00 से 12:54 तक",
    rahukaal: "सुबह 08:58 से सुबह 10:42 तक",
    dishaShool: "पूर्व दिशा",
    remedy: "शनिदेव को तेल अर्पित करें.",
    nakshatraphal: "रोहिणी नक्षत्र कृषि, रोपण और स्थायी कार्यों के लिए उत्तम है.",
    special: "दैनिक पंचांग।"
  }
  
 };
