const allData = {
    "2026-07-21-08-00": [
         { 
            rashi: "लग्न भाव", 
            icon: "🪞", 
            msg: "सिंह राशि में केतु आपके लग्न (प्रथम) भाव में स्थित हैं। आपके स्वभाव में वैराग्य या कुछ असमंजस की स्थिति बन सकती है, तथा आत्म-चिंतन और व्यक्तिगत निर्णय लेते समय मानसिक शांति बनाए रखें।" 
        },
        { 
            rashi: "द्वितीय भाव", 
            icon: "✨", 
            msg: "कन्या राशि में शुक्र आपके द्वितीय (धन/वाणी) भाव में नीच के स्थित हैं। आर्थिक लेन-देन और अपनी वाणी का प्रयोग करते समय विशेष सावधानी बरतें, अन्यथा पारिवारिक मामलों में गलतफहमियां बढ़ सकती हैं।" 
        },
        
        { 
            rashi: "सप्तम भाव", 
            icon: "🌀", 
            msg: "कुंभ राशि में राहु आपके सप्तम भाव में स्थित हैं। दांपत्य जीवन और व्यावसायिक साझेदारियों में गलतफहमी से बचने के लिए संवाद स्पष्ट रखें।" 
        },
        { 
            rashi: "अष्टम भाव", 
            icon: "🪐", 
            msg: "मीन राशि में शनि और नेप्च्यून आपके अष्टम भाव में स्थित हैं। अचानक परिवर्तन, शोध कार्यों या गुप्त मामलों में सावधानी बरतें और स्वास्थ्य का विशेष ध्यान रखें।" 
        },
        
        { 
            rashi: "एकादश भाव", 
             icon: "🔴", 
             msg: "सिंह राशि के जातकों के लिए मंगल और बुध ग्रहों का ग्यारहवें भाव (लाभ भाव) में गोचर बेहद शुभ परिणाम लेकर आया है। आपकी आमदनी में जोरदार इजाफा होने के योग हैं। पुराने निवेशों से भारी मुनाफा मिल सकता है। भाई-बहनों और मित्रों का पूरा सहयोग मिलेगा। समाज में आपका मान-सम्मान बढ़ेगा और आपके द्वारा बनाई गई नई योजनाएं सफल होंगी।"
        },
        { 
            rashi: "द्वादश भाव", 
            icon: "⭐", 
            msg: "कर्क राशि में सूर्य और देवगुरु बृहस्पति (अस्त) आपके द्वादश भाव में स्थित हैं। आध्यात्मिक कार्यों में रुचि बढ़ेगी, साथ ही विदेशी मामलों या खर्चों पर नियंत्रण रखना जरूरी होगा।" 
        }
    ]
};
