const allData = {
    "2026-07-21-08-00": [
        { 
            rashi: "पंचम भाव", 
            icon: "🌀", 
            msg: "कुंभ राशि में राहु आपके पंचम भाव में स्थित हैं। शिक्षा, संतान और रचनात्मक कार्यों में कुछ अप्रत्याशित बदलाव या चुनौतियाँ आ सकती हैं, सोच-समझकर निर्णय लें।" 
        },
        { 
            rashi: "षष्ठ भाव", 
            icon: "🪐", 
            msg: "मीन राशि में शनि (वक्रि) और नेप्च्यून आपके षष्ठ (रोग/शत्रु) भाव में स्थित हैं। गुप्त शत्रुओं से सावधानी बरतें और अपने स्वास्थ्य का विशेष ध्यान रखें।" 
        },
        
        { 
            rashi: "नवम भाव", 
            icon: "🔴", 
            msg: "तुला राशि के लिए मंगल ग्रह नवम (भाग्य) भाव में गोचर कर रहे हैं। इस गोचर के दौरान आपको भाग्य का साथ थोड़ा संघर्ष के बाद मिलेगा। उच्च शिक्षा प्राप्त कर रहे विद्यार्थियों को अपनी पढ़ाई पर अधिक ध्यान देना होगा। लंबी दूरी की यात्राएं हो सकती हैं जो व्यस्तता भरी रहेंगी। पिता या गुरुजनों के साथ वैचारिक मतभेद न हो, इसका विशेष ध्यान रखें।"
        },
        { 
            rashi: "दशम भाव", 
            icon: "🟡", 
            msg: "कर्क राशि में देवगुरु बृहस्पति आपके दशम (कर्म/करियर) भाव में स्थित हैं। कार्यक्षेत्र में मान-सम्मान और पद-प्रतिष्ठा में वृद्धि होगी, वरिष्ठ अधिकारियों का सहयोग प्राप्त होगा।" 
        },
        { 
            rashi: "एकादश भाव", 
            icon: "🌞🟢🟣",
            msg: "सिंह राशि में सूर्य, बुध और केतु आपके एकादश (आय/लाभ) भाव में स्थित हैं। आमदनी के स्रोतों में कुछ उतार-चढ़ाव आ सकता है, तथा बड़े भाई-बहनों या मित्रों के साथ संबंधों में गलतफहमियों से बचने के लिए स्पष्ट संवाद रखें।" 
        },
        { 
            rashi: "द्वादश भाव", 
            icon: "✨", 
            msg: "कन्या राशि में शुक्र आपके द्वादश (व्यय/मोक्ष) भाव में नीच के स्थित हैं। भोग-विलास या अनावश्यक चीजों पर खर्च बढ़ने की संभावना है, तथा नींद की कमी या पैरों से जुड़ी स्वास्थ्य समस्याओं के प्रति सतर्क रहें।" 
        }

    ]
};
