const allData = {
    "2026-07-21-08-00": [
        
        { 
            rashi: "द्वितीय भाव (धन भाव)", 
            icon: "🔴", 
            msg: "वृषभ राशि के जातकों के लिए मंगल ग्रह का द्वितीय भाव में यह गोचर वित्तीय मामलों और पारिवारिक जीवन में विशेष सावधानी की मांग करता है। इस अवधि में धन का निवेश सोच-समझकर करें, व्यर्थ के खर्च बढ़ सकते हैं। पारिवारिक मुद्दों को लेकर तीखी बहस या मतभेद उभर सकते हैं। कार्यक्षेत्र में अपनी तीखी प्रतिक्रियाओं पर नियंत्रण रखें, अन्यथा सहकर्मियों से मनमुटाव हो सकता है।"
        },
        { 
            rashi: "तृतीय भाव", 
            icon: "☀️", 
            msg: "बुध और देवगुरु बृहस्पति ग्रह कर्क राशि में तीसरे भाव में गोचर कर रहे हैं। आपके पराक्रम, आत्मविश्वास और प्रयासों को सकारात्मक दिशा मिलेगी। छोटे भाई-बहनों से सहयोग और सामाजिक कार्यों में रुचि बढ़ेगी।" 
        },
         { 
            rashi: "चतुर्थ भाव", 
            icon: "🪞", 
            msg: "सिंह राशि में सूर्य और केतु आपके चतुर्थ (सुख/माता) भाव में स्थित हैं। घरेलू वातावरण में कुछ मानसिक अशांति या अलगाव की भावना आ सकती है, तथा भूमि-वाहन से जुड़े मामलों और माता के स्वास्थ्य का विशेष ध्यान रखें।" 
        },
        { 
            rashi: "पंचम भाव", 
            icon: "✨", 
            msg: "कन्या राशि में शुक्र आपके पंचम (बुद्धि/संतान/शिक्षा) भाव में नीच के स्थित हैं। विद्यार्थियों की पढ़ाई से एकाग्रता प्रभावित हो सकती है, तथा प्रेम संबंधों या शेयर बाजार जैसे जोखिम भरे निवेश में संभलकर कदम रखें।" 
        },
        
        { 
            rashi: "दशम भाव", 
            icon: "🪐", 
            msg: "कुंभ राशि में राहु दशम भाव में गोचर कर रहे हैं। कार्यक्षेत्र में अचानक बदलाव या चुनौतियां आ सकती हैं, इसलिए अपनी योजनाओं को गुप्त रखें और मेहनत जारी रखें।" 
        },
        { 
            rashi: "एकादश भाव", 
            icon: "🪐", 
            msg: "मीन राशि में शनि ग्यारहवें भाव में गोचर कर रहे हैं। कार्यक्षेत्र में नए अवसर मिलेंगे और आय के स्रोत मजबूत होंगे, परंतु इसके लिए आपको कड़ी मेहनत करनी होगी।" 
        }
    ]
};
